In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("../data/raw/employees.csv")
df.head()

,employee_id,name,department,role_type,manager_id,salary,joining_date,region,performance_score
0,1,Christina Ramos MD,Dept_41,Manager,NaN,104592,2022-01-15,US,4.48
1,2,Joann Gonzalez,Dept_16,Manager,NaN,119256,2019-08-20,EU,4.47
2,3,John Nelson,Dept_44,Manager,NaN,161482,2023-04-13,US,4.18
3,4,Candace Morse,Dept_3,Manager,NaN,93905,2023-08-21,US,3.44
4,5,Gerald Stephens III,Dept_33,Manager,NaN,168907,2018-04-30,US,4.12

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   employee_id        10000 non-null  int64
 1   name               10000 non-null  object
 2   department         10000 non-null  object
 3   role_type          10000 non-null  object
 4   manager_id         9500 non-null   float64
 5   salary             10000 non-null  int64
 6   joining_date       10000 non-null  object
 7   region             10000 non-null  object
 8   performance_score  10000 non-null  float64
dtypes: float64(2), int64(2), object(5)
memory usage: 703.3+ KB

In [5]:
df.isnull().sum()

employee_id            0
name                   0
department             0
role_type              0
manager_id           500
salary                 0
joining_date           0
region                 0
performance_score      0
dtype: int64

In [6]:
df.drop_duplicates(inplace=True)
df["salary"] = df["salary"].fillna(df["salary"].median())

In [8]:
df.to_csv("../data/processed/clean_employees.csv", index=False)